docs/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-06-21 Wed 17:05 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Britt Blog</title>
<meta name="author" content="Britt Anderson" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="preamble" class="status">
<nav>
&emsp; <a href="/index.html">Home</a>
&emsp; <a href="/about.html">About</a>
&emsp; <a href="/pubs.html">Publications</a>
&emsp; <a href="/posts.html">Posts</a>
</nav>
</div>
<div id="content" class="content">
<h1 class="title">Britt Blog</h1>
<p>
Welcome to yet another Britt Blog. You can find some of my academic work in the <a href="pubs.html">Publications</a> section and a bit <a href="about.html">about</a> me as well as some of my recent thoughts in the <a href="#orga32af9a">Older Posts</a> section below. 
</p>


<div id="outline-container-org1d6d146" class="outline-2">
<h2 id="org1d6d146"><span class="section-number-2">1.</span> Recent Posts</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org456ba28" class="outline-3">
<h3 id="org456ba28"><span class="section-number-3">1.1.</span> Setting up email with gnus, mbsync, dovecot, and davmail</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Date: <span class="timestamp-wrapper"><span class="timestamp">&lt;2023-06-15 Thu&gt;</span></span>
Author: Britt Anderson
</p>
</div>
</div>
</div>

<div id="outline-container-org44ca355" class="outline-2">
<h2 id="org44ca355"><span class="section-number-2">2.</span> The problem</h2>
<div class="outline-text-2" id="text-2">
<p>
My university's connect server was recently hacked, which meant that I had to leave the University's internal email system (something I had been resisting for years) for the University's preferred alternative: microsoft 365. So, now I have to reconstruct the pipeline that gets my emails from my various accounts to GNUs on my laptop.
</p>

<p>
<a href="posts/2023-06-15-gnus-email-and-microsoft365.html">read full entry</a> 
</p>
</div>

<div id="outline-container-org3318a2d" class="outline-3">
<h3 id="org3318a2d"><span class="section-number-3">2.1.</span> Epicurus - If it ain't wrong it is still game</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Date: <span class="timestamp-wrapper"><span class="timestamp">&lt;2023-05-19 Fri&gt;</span></span>
Author: Britt Anderson
</p>

<p>
Most of us are familiar with <a href="https://en.wikipedia.org/wiki/Occam%27s_razor">Occam's Razor.</a> It is a heuristic for reasoning that is often framed as the simplest explanation is the best explanation. What many of us do though is misinterpret this heuristic as suggesting that the simplest explanation is the <b>right</b> explanation. A nice by product of reading some of the literature around Solomonoff induction is to be reminded of the companion idea that any hypothesis not contradicted by experience should be retained in your set of possible answers.
</p>

<p>
<a href="posts/2023-05-19-epicurus.html">read full entry</a> 
</p>
</div>
</div>

<div id="outline-container-org9d257fe" class="outline-3">
<h3 id="org9d257fe"><span class="section-number-3">2.2.</span> Coincidence and Inductive Inference</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Date: <span class="timestamp-wrapper"><span class="timestamp">&lt;2023-05-15 Mon&gt;</span></span>
Author: Britt Anderson
</p>

<p>
During the pandemic, and for a term or two thereafter, I, like a lot of men, let myself grow a beard and let my hair get a bit crazy. One day when I was trying to track down a reference about something (I forget exactly what) I came across this image <a href="https://external-content.duckduckgo.com/iu/?u=https%3A%2F%2Ftse1.mm.bing.net%2Fth%3Fid%3DOIP.wJ0Z713Zmu1ymJu7dv45IAHaKt%26pid%3DApi&amp;f=1&amp;ipt=65c31f7f09559cc54323f891c4c0812e607b7698085d75222ca366bd551e99a7&amp;ipo=images">of Ray Solomonoff</a> and was struck by our similar hair-dos. Who was this guy? While it was the overlapping of my interests and his work that led me to the web page where the picture appeared it was the overlap of our beard aesthetics that led me to read more about him in particular. I am so glad I did.
</p>

<p>
<a href="posts/2023-05-15-inductive-inference.html">read full entry</a> 
</p>
</div>
</div>

<div id="outline-container-orga2fa93b" class="outline-3">
<h3 id="orga2fa93b"><span class="section-number-3">2.3.</span> RSS Feeds From Org Mode and Ox-rss</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Date: <span class="timestamp-wrapper"><span class="timestamp">&lt;2023-04-08 Sat&gt;</span></span>
Author: Britt Anderson
</p>

<p>
Just a place holder for now, but to come is a tear stained entry of my efforts to come to terms with RSS feeds and org for blogging.
</p>

<p>
<a href="posts/2023-04-08-rss-and-org-mode.html">read full entry</a> 
</p>
</div>
</div>
</div>


<div id="outline-container-orga32af9a" class="outline-2">
<h2 id="orga32af9a"><span class="section-number-2">3.</span> Older Posts</h2>
<div class="outline-text-2" id="text-3">
<p>
<a href="posts.html">Post List</a>
</p>
</div>
</div>

<div id="outline-container-org8742cf2" class="outline-2">
<h2 id="org8742cf2"><span class="section-number-2">4.</span> RSS</h2>
<div class="outline-text-2" id="text-4">
<p>
<a href="https://brittanderson.github.io/posts/sitemap.xml">RSS Feed</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2023-04-03 Mon 00:00</p>
<p class="author">Author: Britt Anderson</p>
<p class="date">Created: 2023-06-21 Wed 17:05</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>